{
  "meta": {
    "name": "Onat Çipli",
    "avatarUrl": "https://media.licdn.com/dms/image/v2/C5603AQHbo9urJTGD9A/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1535182969746?e=1770249600&v=beta&t=r5Ztq2_eEWdf0-hnQ4TT8fkOmgpn_1BM6L3rtkKJ19s",
    "email": "",
    "github": "https://github.com/onatcipli",
    "linkedin": "https://linkedin.com/in/onatcipli",
    "twitter": "",
    "website": "https://onatcipli.dev"
  },
  "en": {
    "title": "Senior Mobile Developer",
    "bio": "Senior Mobile Developer with <strong>8 years of experience</strong> building production apps for clients across <strong>Ireland, UK, Germany, Greece, and Turkey</strong>. I specialize in Flutter, React Native, and Native Android development, with deep expertise in video/audio streaming, DRM implementation, and scalable multi-flavor architectures.",
    "aboutTitle": "About Me",
    "aboutContent": [
      "I started my journey in <strong>2018</strong> during university, building games with Unity and exploring mobile development with early Flutter versions. After graduating from İzmir Ekonomi Üniversitesi with a Software Engineering degree, I joined LOGO Yazılım where I led the evaluation of cross-platform frameworks, ultimately <strong>championing Flutter adoption</strong> for the company.",
      "In 2020, I joined <strong>Square1</strong> and collaborated closely with the CTO on challenging projects for international clients. I've built everything from food delivery platforms managing <strong>16 white-label apps</strong> from a single codebase, to <strong>Twitch-like streaming platforms</strong>, to children's media apps with complex <strong>DRM and offline playback</strong>.",
      "Beyond client work, I'm an active open source contributor. I created the <strong>Flutter Rename CLI</strong> with <strong>1,280+ likes</strong> and <strong>29,000+ downloads</strong> on pub.dev, and I've contributed to the <strong>Flutter framework</strong> itself—creating issues, fixing bugs, and writing tests that were merged into the official repository."
    ],
    "skillsTitle": "Skills & Expertise",
    "skillsDesc": "Technologies and tools I work with",
    "educationTitle": "Education",
    "experienceTitle": "Work Experience",
    "timelineTitle": "Project Timeline",
    "projectsTitle": "Projects & Apps",
    "opensourceTitle": "Open Source",
    "footer": "All rights reserved."
  },
  "tr": {
    "title": "Kıdemli Mobil Geliştirici",
    "bio": "<strong>İrlanda, İngiltere, Almanya, Yunanistan ve Türkiye</strong>'deki müşteriler için production uygulamalar geliştiren <strong>8 yıllık deneyime</strong> sahip Kıdemli Mobil Geliştirici. Flutter, React Native ve Native Android geliştirme konularında uzmanım. Video/audio streaming, DRM implementasyonu ve ölçeklenebilir multi-flavor mimariler konularında derin tecrübem var.",
    "aboutTitle": "Hakkımda",
    "aboutContent": [
      "Yolculuğuma <strong>2018</strong>'de üniversitede Unity ile oyunlar geliştirerek ve erken Flutter versiyonlarıyla mobil geliştirmeyi keşfederek başladım. İzmir Ekonomi Üniversitesi'nden Yazılım Mühendisliği diplomasıyla mezun olduktan sonra LOGO Yazılım'a katıldım ve cross-platform framework'lerin değerlendirmesini yönettim, sonuçta şirket için <strong>Flutter'ın benimsenmesini</strong> sağladım.",
      "2020'de <strong>Square1</strong>'e katıldım ve CTO ile birlikte uluslararası müşteriler için zorlu projeler üzerinde çalıştım. Tek codebase'den <strong>16 white-label uygulamayı</strong> yöneten yemek sipariş platformlarından, <strong>Twitch benzeri streaming platformlarına</strong>, karmaşık <strong>DRM ve offline playback</strong> içeren çocuk medya uygulamalarına kadar her şeyi geliştirdim.",
      "Müşteri işlerinin ötesinde, aktif bir açık kaynak katkıcısıyım. pub.dev'de <strong>1.280+ beğeni</strong> ve <strong>29.000+ indirme</strong> ile <strong>Flutter Rename CLI</strong>'ı oluşturdum ve <strong>Flutter framework</strong>'üne katkıda bulundum—issue'lar oluşturdum, buglar düzelttim ve resmi repository'e merge edilen testler yazdım."
    ],
    "skillsTitle": "Yetenekler ve Uzmanlık",
    "skillsDesc": "Çalıştığım teknolojiler ve araçlar",
    "educationTitle": "Eğitim",
    "experienceTitle": "İş Deneyimi",
    "timelineTitle": "Proje Zaman Çizelgesi",
    "projectsTitle": "Projeler ve Uygulamalar",
    "opensourceTitle": "Açık Kaynak",
    "footer": "Tüm hakları saklıdır."
  },
  "skills": [
    "Flutter",
    "Dart",
    "React Native",
    "Ionic",
    "TypeScript",
    "Kotlin",
    "Swift",
    "Firebase",
    "RESTful APIs",
    "GraphQL",
    "CI/CD",
    "Unity",
    "C#",
    { "en": "Video/Audio Streaming", "tr": "Video/Audio Streaming" },
    { "en": "DRM Implementation", "tr": "DRM Implementasyonu" },
    { "en": "Clean Architecture", "tr": "Clean Architecture" },
    { "en": "Design Patterns", "tr": "Design Patterns" }
  ],
  "education": [
    {
      "school": "İzmir Ekonomi Üniversitesi",
      "schoolUrl": "https://www.ieu.edu.tr",
      "degree": {
        "en": "Master's Degree in Software Engineering (Incomplete)",
        "tr": "Yazılım Mühendisliği Yüksek Lisans (Tamamlanmadı)"
      },
      "date": "2019 - 2020",
      "description": {
        "en": "Completed 1 year of Master's program before leaving to focus on career opportunities. Studied advanced software engineering topics.",
        "tr": "Kariyer fırsatlarına odaklanmak için ayrılmadan önce Yüksek Lisans programının 1 yılını tamamladım. İleri düzey yazılım mühendisliği konularını çalıştım."
      }
    },
    {
      "school": "İzmir Ekonomi Üniversitesi",
      "schoolUrl": "https://www.ieu.edu.tr",
      "degree": {
        "en": "Bachelor's Degree in Software Engineering",
        "tr": "Yazılım Mühendisliği Lisans"
      },
      "date": "2014 - 2019",
      "description": {
        "en": "Studied core software engineering principles including Java, Design Patterns, QA, Software Architecture, Algorithms, Data Structures, and Database Management. Started mobile development journey in 2018.",
        "tr": "Java, Design Patterns, QA, Yazılım Mimarisi, Algoritma, Veri Yapıları ve Veritabanı Yönetimi gibi temel yazılım mühendisliği prensiplerini öğrendim. 2018'de mobil geliştirme yolculuğuma başladım."
      },
      "projects": [
        {
          "name": "Discover Steps",
          "date": "2019",
          "tags": ["Flutter"],
          "platform": "mobile",
          "type": {
            "en": "Graduation Project",
            "tr": "Bitirme Projesi"
          },
          "description": {
            "en": "Mobile app offering step-by-step city tours for travelers. Users can create and follow location-based interactive tours with step-by-step navigation.",
            "tr": "Gezginler için adım adım şehir turları sunan mobil uygulama. Kullanıcılar lokasyon bazlı interaktif turlar oluşturabilir ve step-by-step navigasyon ile takip edebilir."
          }
        },
        {
          "name": {
            "en": "Flutter Web Interactive Slides",
            "tr": "Flutter Web İnteraktif Slaytlar"
          },
          "date": "2019",
          "tags": ["Flutter", "Web"],
          "platform": "web",
          "youtube": "https://www.youtube.com/watch?v=YvNcvYKggx8",
          "description": {
            "en": "Built an interactive presentation/slides application using Flutter Web. Demonstrated Flutter's web capabilities for creating dynamic, animated presentations.",
            "tr": "Flutter Web kullanarak interaktif sunum/slayt uygulaması geliştirdim. Dinamik, animasyonlu sunumlar oluşturmak için Flutter'ın web yeteneklerini gösterdim."
          }
        },
        {
          "name": "The Ozon",
          "date": "2017",
          "tags": ["Unity", "C#"],
          "platform": "mobile",
          "youtube": "https://www.youtube.com/watch?v=FbK-TfsalSE",
          "type": {
            "en": "University Game Project",
            "tr": "Üniversite Oyun Projesi"
          },
          "description": {
            "en": "First game developed during university using Unity game engine and C#. A complete game project showcasing game development fundamentals.",
            "tr": "Üniversite sırasında Unity oyun motoru ve C# kullanarak geliştirilen ilk oyun. Oyun geliştirme temellerini sergileyen tam bir oyun projesi."
          }
        },
        {
          "name": {
            "en": "Mobile App Projects",
            "tr": "Mobil Uygulama Projeleri"
          },
          "date": "2018 - 2019",
          "tags": ["Flutter", "React Native"],
          "platform": "mobile",
          "description": {
            "en": "Cross-platform mobile application development with Flutter and React Native",
            "tr": "Flutter ve React Native ile cross-platform mobil uygulama geliştirme"
          }
        }
      ]
    }
  ],
  "experience": [
    {
      "company": {
        "en": "Open Source",
        "tr": "Açık Kaynak"
      },
      "location": {
        "en": "Personal Projects",
        "tr": "Kişisel Projeler"
      },
      "date": {
        "en": "2019 - Present",
        "tr": "2019 - Günümüz"
      },
      "role": {
        "en": "Creator & Maintainer",
        "tr": "Yaratıcı & Sürdürücü"
      },
      "summary": {
        "en": [
          "Created and maintain popular open source tools used by the Flutter community",
          "Active contributor to the Flutter framework with merged PRs"
        ],
        "tr": [
          "Flutter topluluğu tarafından kullanılan popüler açık kaynak araçlar oluşturdum ve sürdürüyorum",
          "Merge edilmiş PR'larla Flutter framework'üne aktif katkıcı"
        ]
      },
      "projects": [
        {
          "name": "Flutter Rename CLI",
          "order": 0,
          "date": { "en": "2019 - Present", "tr": "2019 - Günümüz" },
          "startDate": "2019-01",
          "url": "https://github.com/onatcipli/rename",
          "pubdev": "https://pub.dev/packages/rename",
          "tags": ["Dart", "CLI", "pub.dev"],
          "platform": "backend",
          "description": {
            "en": "Created a CLI tool for renaming Flutter apps with <strong>1,280+ likes</strong> and <strong>29,000+ downloads</strong> on pub.dev. Supports <strong>6 platforms</strong>: iOS, Android, macOS, Linux, Windows, and Web. Used by thousands of Flutter developers worldwide for managing app names and bundle IDs.",
            "tr": "pub.dev'de <strong>1.280+ beğeni</strong> ve <strong>29.000+ indirme</strong> ile Flutter uygulama yeniden adlandırma CLI aracı oluşturdum. <strong>6 platform</strong> destekler: iOS, Android, macOS, Linux, Windows ve Web. Dünya çapında binlerce Flutter geliştiricisi tarafından uygulama adları ve bundle ID'leri yönetmek için kullanılıyor."
          }
        }
      ]
    },
    {
      "company": "Square1",
      "companyUrl": "https://square1.io",
      "location": {
        "en": "Dublin, Ireland",
        "tr": "Dublin, İrlanda"
      },
      "date": {
        "en": "Aug 2020 - Jan 2025",
        "tr": "Ağu 2020 - Oca 2025"
      },
      "role": {
        "en": "Flutter Developer",
        "tr": "Flutter Developer"
      },
      "summary": {
        "en": [
          "Collaborated closely with the CTO, developing mobile solutions for international clients across Ireland, UK, Germany, and Greece",
          "Led mobile architecture decisions and took full technical ownership of multiple projects",
          "Built complex streaming infrastructure, DRM systems, and multi-flavor app architectures",
          "Developed internal tooling including CLI tools for automated app generation"
        ],
        "tr": [
          "CTO ile yakın çalışarak İrlanda, İngiltere, Almanya ve Yunanistan'dan uluslararası müşterilere mobil çözümler geliştirdim",
          "Mobil mimari kararlarını yönettim ve birçok projede tam teknik sahiplik aldım",
          "Karmaşık streaming altyapısı, DRM sistemleri ve multi-flavor uygulama mimarileri kurdum",
          "Otomatik uygulama üretimi için CLI araçları dahil internal tooling geliştirdim"
        ]
      },
      "projects": [
        {
          "name": "Caboodle",
          "order": 1,
          "date": { "en": "Jan 2021 - Jan 2025", "tr": "Oca 2021 - Oca 2025" },
          "startDate": "2021-01",
          "endDate": "2025-01",
          "url": "https://citygrab.co.uk",
          "tags": ["Flutter", "Firebase", "CLI"],
          "platform": "mobile",
          "description": {
            "en": "Food delivery platform for Ireland and UK market. Managed <strong>16 different white-label apps</strong> from a <strong>single codebase</strong> using flavor-based architecture. <strong>Full technical ownership</strong> of mobile side. Built custom CLI tool for automated app generation from JSON configuration.",
            "tr": "İrlanda ve İngiltere pazarı için yemek sipariş platformu. Flavor-based mimari ile <strong>tek codebase'den 16 farklı white-label uygulamayı</strong> yönettim. Mobil tarafın <strong>tam teknik sorumluluğu</strong>. JSON konfigürasyonundan otomatik uygulama üretimi için özel CLI tool geliştirdim."
          }
        },
        {
          "name": "Say TV",
          "order": 4,
          "date": { "en": "Mar 2022 - Dec 2023", "tr": "Mar 2022 - Ara 2023" },
          "startDate": "2022-03",
          "endDate": "2023-12",
          "tags": ["Flutter", "Firebase", "Streaming"],
          "platform": "mobile",
          "description": {
            "en": "<strong>Twitch-like live streaming</strong> and chat platform for German TV shows and sports events. Built <strong>video/audio streaming infrastructure</strong> and <strong>real-time chat system</strong>. Implemented push notification systems and live event synchronization.",
            "tr": "Alman TV programları ve spor etkinlikleri için <strong>Twitch benzeri canlı yayın</strong> ve chat platformu. <strong>Video/audio streaming altyapısı</strong> ve <strong>real-time chat sistemi</strong> kurdum. Push notification ve canlı etkinlik senkronizasyonu implemente ettim."
          }
        },
        {
          "name": "Kids Radio",
          "order": 6,
          "date": { "en": "Jun 2023 - Nov 2024", "tr": "Haz 2023 - Kas 2024" },
          "startDate": "2023-06",
          "endDate": "2024-11",
          "appStore": "https://apps.apple.com/us/app/kids-radio/id6464392731",
          "tags": ["Flutter", "DRM", "Streaming", "Offline"],
          "platform": "mobile",
          "description": {
            "en": "Children's media platform for Greek client. <strong>YouTube + Spotify hybrid</strong> concept with video, audiobooks and radio content. Implemented <strong>background playback</strong>, <strong>offline download with DRM protection</strong>. Built <strong>Abstract Player pattern</strong> for unified playback across all media types with Spotify-style queue system.",
            "tr": "Yunan müşteri için çocuklara yönelik medya platformu. Video, audiobook ve radyo içerikli <strong>YouTube + Spotify karışımı</strong> konsept. <strong>Background playback</strong>, <strong>DRM korumalı offline indirme</strong> implemente ettim. Tüm medya tipleri için Spotify tarzı queue sistemi ile <strong>Abstract Player pattern</strong> kurdum."
          }
        },
        {
          "name": "Coosto",
          "order": 2,
          "date": { "en": "Aug 2020 - Feb 2021", "tr": "Ağu 2020 - Şub 2021" },
          "startDate": "2020-08",
          "endDate": "2021-02",
          "url": "https://www.coosto.com/en",
          "appStore": "https://apps.apple.com/us/app/coosto/id778600146",
          "tags": ["Kotlin", "Android Native"],
          "platform": "mobile",
          "description": {
            "en": "Social media management app for Dutch client. Native Android development for multi-platform content publishing to Facebook, Instagram, and Twitter. Implemented scheduling, analytics dashboard and team collaboration features.",
            "tr": "Hollandalı müşteri için sosyal medya yönetim uygulaması. Facebook, Instagram ve Twitter'a içerik paylaşımı için Native Android geliştirme. Zamanlama, analitik dashboard ve takım işbirliği özellikleri implemente ettim."
          }
        },
        {
          "name": "MyHome",
          "order": 3,
          "date": { "en": "Feb 2021 - Jun 2021", "tr": "Şub 2021 - Haz 2021" },
          "startDate": "2021-02",
          "endDate": "2021-06",
          "url": "https://www.myhome.ie/",
          "appStore": "https://apps.apple.com/ie/app/myhome-ie/id368923847",
          "playStore": "https://play.google.com/store/apps/details?id=ie.myhome.android.app",
          "tags": ["Kotlin", "Android Native"],
          "platform": "mobile",
          "description": {
            "en": "Ireland's leading real estate platform. Native Android development for property listings, search with map integration, and saved properties management.",
            "tr": "İrlanda'nın önde gelen emlak platformu. Emlak listeleme, harita entegrasyonlu arama ve kayıtlı mülk yönetimi için Native Android geliştirme."
          }
        },
        {
          "name": "Irish Times",
          "order": 5,
          "date": { "en": "Sep 2021 - Mar 2022", "tr": "Eyl 2021 - Mar 2022" },
          "startDate": "2021-09",
          "endDate": "2022-03",
          "appStore": "https://apps.apple.com/us/app/the-irish-times-epaper/id671732877",
          "playStore": "https://play.google.com/store/apps/details?id=ie.irishtimes.reader",
          "tags": ["React Native"],
          "platform": "mobile",
          "description": {
            "en": "Mobile app for Ireland's leading news platform. React Native development with offline reading, push notifications, and subscription management.",
            "tr": "İrlanda'nın önde gelen haber platformu için mobil uygulama. Offline okuma, push notification ve abonelik yönetimi ile React Native geliştirme."
          }
        },
        {
          "name": "Business Post",
          "order": 7,
          "date": { "en": "Apr 2022 - Aug 2022", "tr": "Nis 2022 - Ağu 2022" },
          "startDate": "2022-04",
          "endDate": "2022-08",
          "appStore": "https://apps.apple.com/us/app/the-business-post/id467117236",
          "playStore": "https://play.google.com/store/apps/details?id=ie.businesspost.android",
          "tags": ["Flutter"],
          "platform": "mobile",
          "description": {
            "en": "Content aggregator app with direct source data fetching architecture. Designed and built the project infrastructure from scratch including caching layer and offline support.",
            "tr": "Direkt kaynaklardan veri çekme mimarisine sahip içerik toplama uygulaması. Cache katmanı ve offline destek dahil proje altyapısını sıfırdan tasarlayıp kurdum."
          }
        }
      ]
    },
    {
      "company": "LOGO Yazılım",
      "companyUrl": "https://www.logo.com.tr",
      "location": {
        "en": "Turkey",
        "tr": "Türkiye"
      },
      "date": {
        "en": "Jun 2018 - Aug 2020",
        "tr": "Haz 2018 - Ağu 2020"
      },
      "role": {
        "en": "Software Development Specialist",
        "tr": "Yazılım Geliştirme Uzmanı"
      },
      "summary": {
        "en": [
          "Started as intern, progressed to part-time during university, then full-time after graduation",
          "Worked in R&D team on cross-platform mobile development evaluation and implementation",
          "Led proof-of-concept development comparing Flutter, React Native, and Ionic frameworks",
          "Published enterprise applications to both Android and iOS platforms"
        ],
        "tr": [
          "Stajyer olarak başladım, üniversite süresince part-time devam ettim, mezuniyetten sonra full-time geçtim",
          "Ar-Ge takımında cross-platform mobil geliştirme değerlendirmesi ve implementasyonu üzerinde çalıştım",
          "Flutter, React Native ve Ionic framework'lerini karşılaştıran POC geliştirmelerini yönettim",
          "Kurumsal uygulamaları Android ve iOS platformlarına yayınladım"
        ]
      },
      "projects": [
        {
          "name": {
            "en": "Cross-Platform Framework POC",
            "tr": "Cross-Platform Framework POC"
          },
          "order": 9,
          "date": { "en": "Jan 2019 - Jun 2019", "tr": "Oca 2019 - Haz 2019" },
          "startDate": "2019-01",
          "endDate": "2019-06",
          "tags": ["Flutter", "React Native", "Ionic"],
          "platform": "mobile",
          "description": {
            "en": "Developed Flutter and React Native versions of company's existing Ionic app as proof of concept. Conducted comprehensive comparative analysis on performance metrics, development velocity, and team adaptability. Results led to Flutter adoption for new projects.",
            "tr": "Şirketin mevcut Ionic uygulamasının Flutter ve React Native versiyonlarını POC olarak geliştirdim. Performans metrikleri, geliştirme hızı ve ekip uyumu konularında kapsamlı karşılaştırmalı analiz yaptım. Sonuçlar yeni projeler için Flutter'ın benimsenmesine yol açtı."
          }
        },
        {
          "name": "Document Management System",
          "order": 8,
          "date": { "en": "Jun 2018 - Dec 2018", "tr": "Haz 2018 - Ara 2018" },
          "startDate": "2018-06",
          "endDate": "2018-12",
          "tags": ["Ionic", "TypeScript"],
          "platform": "mobile",
          "description": {
            "en": "Enterprise document management application with file upload, categorization, search, and offline access. Published to Android and iOS platforms.",
            "tr": "Dosya yükleme, kategorileme, arama ve offline erişim özellikleriyle kurumsal doküman yönetim uygulaması. Android ve iOS platformlarına yayınladım."
          }
        },
        {
          "name": "Journey",
          "order": 10,
          "date": { "en": "Jul 2019 - Mar 2020", "tr": "Tem 2019 - Mar 2020" },
          "startDate": "2019-07",
          "endDate": "2020-03",
          "tags": ["Flutter", "Ionic"],
          "platform": "mobile",
          "description": {
            "en": "Enterprise mobile application developed from POC to production. Handled full development lifecycle including architecture design, implementation, and deployment.",
            "tr": "POC'tan üretime geliştirilen kurumsal mobil uygulama. Mimari tasarım, implementasyon ve deployment dahil tam geliştirme döngüsünü yönettim."
          }
        },
        {
          "name": "Low Code Platform",
          "order": 11,
          "date": { "en": "Apr 2020 - Aug 2020", "tr": "Nis 2020 - Ağu 2020" },
          "startDate": "2020-04",
          "endDate": "2020-08",
          "tags": ["Flutter", "Web"],
          "platform": "web",
          "description": {
            "en": "Low-code application and website development platform. Built mobile preview and rendering engine for dynamically generated UIs.",
            "tr": "Low-code uygulama ve web sitesi geliştirme platformu. Dinamik olarak üretilen UI'lar için mobil önizleme ve rendering motoru geliştirdim."
          }
        }
      ]
    }
  ],
  "projects": [],
  "opensource": [
    {
      "name": "rename",
      "url": "https://github.com/onatcipli/rename",
      "pubdev": "https://pub.dev/packages/rename",
      "description": {
        "en": "Popular CLI tool for renaming Flutter apps with <strong>1,280+ likes</strong> and <strong>29,000+ downloads</strong> on pub.dev. Change app name, bundle ID, and package name for iOS, Android, macOS, Linux, Windows, and Web platforms with a single command.",
        "tr": "pub.dev'de <strong>1.280+ beğeni</strong> ve <strong>29.000+ indirme</strong> ile popüler Flutter uygulama yeniden adlandırma CLI aracı. Tek komutla iOS, Android, macOS, Linux, Windows ve Web platformları için uygulama adı, bundle ID ve paket adını değiştirin."
      },
      "language": "Dart",
      "likes": 1280,
      "downloads": 29000
    },
    {
      "name": "flutter/flutter",
      "url": "https://github.com/flutter/flutter",
      "description": {
        "en": "Official Flutter framework contributor. Created issues, fixed bugs, and wrote tests that were merged into the official repository.",
        "tr": "Resmi Flutter framework katkıcısı. Issue'lar oluşturdum, buglar düzelttim ve resmi repository'e merge edilen testler yazdım."
      },
      "language": "Dart",
      "stars": 0,
      "forks": 0,
      "isContribution": true
    }
  ]
}
